In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
%cd '/content/drive/My Drive/Kaggle'

/content/drive/My Drive/Kaggle

In [4]:
import pandas as pd
import matplotlib.pyplot as plt

from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split

df = pd.read_csv('titanic_train.csv')
df.head()

   passenger_id  pclass  ...                 home.dest survived
0          1216       3  ...                       NaN        1
1           699       3  ...                   Croatia        0
2          1267       3  ...                       NaN        0
3           449       2  ...      Cornwall / Akron, OH        1
4           576       2  ...  Barre, Co Washington, VT        0

[5 rows x 15 columns]

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 850 entries, 0 to 849
Data columns (total 15 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  850 non-null    int64
 1   pclass        850 non-null    int64
 2   name          850 non-null    object
 3   sex           850 non-null    object
 4   age           676 non-null    float64
 5   sibsp         850 non-null    int64
 6   parch         850 non-null    int64
 7   ticket        850 non-null    object
 8   fare          849 non-null    float64
 9   cabin         191 non-null    object
 10  embarked      849 non-null    object
 11  boat          308 non-null    object
 12  body          73 non-null     float64
 13  home.dest     464 non-null    object
 14  survived      850 non-null    int64
dtypes: float64(3), int64(5), object(7)
memory usage: 99.7+ KB

In [6]:
df.drop(['body','boat','home.dest','name','passenger_id','cabin','embarked'], axis=1, inplace=True)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 850 entries, 0 to 849
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    850 non-null    int64
 1   sex       850 non-null    object
 2   age       676 non-null    float64
 3   sibsp     850 non-null    int64
 4   parch     850 non-null    int64
 5   ticket    850 non-null    object
 6   fare      849 non-null    float64
 7   survived  850 non-null    int64
dtypes: float64(2), int64(4), object(2)
memory usage: 53.2+ KB

In [9]:
df.drop('ticket', axis=1, inplace=True)
df.isna().sum()

pclass        0
sex           0
age         174
sibsp         0
parch         0
fare          1
survived      0
dtype: int64

In [10]:
df.fillna(df.age.mean(), inplace=True)

In [11]:
df.isna().sum()

pclass      0
sex         0
age         0
sibsp       0
parch       0
fare        0
survived    0
dtype: int64

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 850 entries, 0 to 849
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    850 non-null    int64
 1   sex       850 non-null    object
 2   age       850 non-null    float64
 3   sibsp     850 non-null    int64
 4   parch     850 non-null    int64
 5   fare      850 non-null    float64
 6   survived  850 non-null    int64
dtypes: float64(2), int64(4), object(1)
memory usage: 46.6+ KB

In [15]:
pd.get_dummies(df)

     pclass        age  sibsp  parch     fare  survived  sex_female  sex_male
0         3  29.519847      0      0   7.7333         1           1         0
1         3  38.000000      0      0   8.6625         0           0         1
2         3  30.000000      1      1  24.1500         0           1         0
3         2  54.000000      1      3  23.0000         1           1         0
4         2  40.000000      0      0  13.0000         0           0         1
..      ...        ...    ...    ...      ...       ...         ...       ...
845       1  55.000000      0      0  50.0000         0           0         1
846       1  58.000000      0      0  29.7000         0           0         1
847       2  24.000000      1      0  26.0000         1           1         0
848       3   3.000000      1      1  13.7750         0           1         0
849       2  52.000000      0      0  13.0000         0           0         1

[850 rows x 8 columns]

In [16]:
df.head()

   pclass     sex        age  sibsp  parch     fare  survived
0       3  female  29.519847      0      0   7.7333         1
1       3    male  38.000000      0      0   8.6625         0
2       3  female  30.000000      1      1  24.1500         0
3       2  female  54.000000      1      3  23.0000         1
4       2    male  40.000000      0      0  13.0000         0

In [17]:
df = pd.get_dummies(df)
df.head()

   pclass        age  sibsp  parch     fare  survived  sex_female  sex_male
0       3  29.519847      0      0   7.7333         1           1         0
1       3  38.000000      0      0   8.6625         0           0         1
2       3  30.000000      1      1  24.1500         0           1         0
3       2  54.000000      1      3  23.0000         1           1         0
4       2  40.000000      0      0  13.0000         0           0         1

In [18]:
df.dtypes

pclass          int64
age           float64
sibsp           int64
parch           int64
fare          float64
survived        int64
sex_female      uint8
sex_male        uint8
dtype: object

In [21]:
import numpy as np

np.random.seed(42)

X = df.drop('survived', axis=1)
y = df.survived

len(X), len(y)

(850, 850)

In [22]:
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.2)

In [23]:
len(X_train), len(X_test)

(680, 170)

In [24]:
clf = RandomForestClassifier()
clf.fit(X_train,y_train)
clf.score(X_test,y_test)

0.8235294117647058